---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.Dispose
source: html/a637738b-5a16-7783-de47-0829610e360d.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.Dispose Method

Releases all resources used by the DuctFittingAndAccessoryData

## Syntax (C#)
```csharp
public void Dispose()
```